# UseDefault Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions..::..UseDefault Property
FormatOptions Class See Also
---
Indicates whether default or custom formatting should be used.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool UseDefault { get; set; }
```

Visual Basic
---
```text
Public Property UseDefault As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UseDefault {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if default formatting should be used; false if custom formatting should be used.
# Remarks
If UseDefault is true, formatting will be according to the default settings in the Units class, and none of the other settings in the object are meaningful. If UseDefault is false, the object contains custom settings that override the default settings in the Units class. UseDefault is always false for FormatOptions objects in the Units class.
# See Also
FormatOptions Class
Autodesk.Revit.DB Namespace